ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_memss_misci_regs.xml
<module id="MEMSS_MISCI_REGS" HW_revision="" description="MEMSS MISCI Registers">
	<register id="MEM_DLB_CONFIG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Dataline buffer enable">
		<bitfield id="CPU1_DLB_EN" description="CPU1 Data line buffer Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_DLB_EN" description="CPU2 Data line buffer Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_DLB_EN" description="CPU3 Data line buffer Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SYNCBRIDGE_DLB_EN" description="Sync Bridge Dataline buffer Enable" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="MEM_DLB_CONFIG_LOCK" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Temporary Lock for DLB Configuration Register ">
		<bitfield id="MEM_DLB_CONFIG" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MEM_DLB_CONFIG_COMMIT" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Permament Lock for DLB Configuration Register ">
		<bitfield id="MEM_DLB_CONFIG_LOCK" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_LOCK" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Peripheral Memory Test Lock Register">
		<bitfield id="PERI_MEM_TEST_CONTROL" description="PERI_MEM_TEST_CONTROL Lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PERI_MEM_TEST_CONTROL" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Peripheral Memory Test control Register">
		<bitfield id="EtherCAT_MEM_FORCE_ERROR" description="Force Parity Error on EtherCAT RAM" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST" width="32" page="0" offset="0x1fc" instances="1" instaddr="4" internal="0" description="Enabling the parity test feature">
		<bitfield id="TESTEN" description="Parity test enable" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
